app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
    @all_ratings = Movie.getRatings

    #@ratings = @all_ratings
    session[:ratings] ||= @all_ratings
    session[:sortMovies] ||= 'id'

    if params[:sortMovies] == 'sortName'
      @movies = @movies.order(:title)
      session[:sortMovies] = :title
    end

    if params[:sortMovies] == 'sortRelease'
      @movies = @movies.order(:release_date)
      session[:sortMovies] = :release_date
    end

    session[:ratings] = params[:ratings].keys if params[:ratings]
    @ratings = session[:ratings] if session[:ratings]
    #@sortMovies = session[:sortMovies]
    @movies = Movie.where(rating: @ratings).order(session[:sortMovies])
---
SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies"  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies"  ORDER BY "movies"."release_date" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY "movies"."release_date" ASC